{"format": "graph-model", "generatedBy": "2.5.0-rc1", "convertedBy": "TensorFlow.js Converter v3.12.0", "signature": {"inputs": {"conv2d_input": {"name": "conv2d_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "224"}, {"size": "224"}, {"size": "3"}]}}}, "outputs": {"dense_1": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "2"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/ScaryNet/conv2d/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "11"}, {"size": "11"}, {"size": "3"}, {"size": "36"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ScaryNet/conv2d/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "36"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ScaryNet/conv2d_1/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "36"}, {"size": "12"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ScaryNet/conv2d_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "12"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ScaryNet/conv2d_2/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "12"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ScaryNet/conv2d_2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ScaryNet/conv2d_3/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "12"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ScaryNet/conv2d_3/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "12"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ScaryNet/conv2d_4/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "12"}, {"size": "56"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ScaryNet/conv2d_4/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "56"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ScaryNet/conv2d_5/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "56"}, {"size": "56"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ScaryNet/conv2d_5/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "56"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ScaryNet/conv2d_6/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "56"}, {"size": "56"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ScaryNet/conv2d_6/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "56"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ScaryNet/conv2d_7/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "56"}, {"size": "56"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ScaryNet/conv2d_7/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "56"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ScaryNet/conv2d_8/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "56"}, {"size": "56"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ScaryNet/conv2d_8/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "56"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ScaryNet/conv2d_9/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "56"}, {"size": "72"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ScaryNet/conv2d_9/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "72"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ScaryNet/conv2d_10/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "72"}, {"size": "112"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ScaryNet/conv2d_10/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "112"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ScaryNet/conv2d_11/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "112"}, {"size": "224"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ScaryNet/conv2d_11/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "224"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ScaryNet/global_average_pooling2d/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ScaryNet/dense/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "224"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ScaryNet/dense/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ScaryNet/dense_1/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ScaryNet/dense_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "224"}, {"size": "224"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ScaryNet/batch_normalization/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ScaryNet/batch_normalization/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ScaryNet/batch_normalization_1/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "56"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ScaryNet/batch_normalization_1/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "56"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ScaryNet/conv2d/Relu", "op": "_FusedConv2D", "input": ["conv2d_input", "StatefulPartitionedCall/ScaryNet/conv2d/Conv2D/ReadVariableOp", "StatefulPartitionedCall/ScaryNet/conv2d/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/ScaryNet/conv2d_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/ScaryNet/conv2d/Relu", "StatefulPartitionedCall/ScaryNet/conv2d_1/Conv2D/ReadVariableOp", "StatefulPartitionedCall/ScaryNet/conv2d_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/ScaryNet/activation/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/ScaryNet/conv2d_1/Relu", "StatefulPartitionedCall/ScaryNet/conv2d_2/Conv2D/ReadVariableOp", "StatefulPartitionedCall/ScaryNet/conv2d_2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/ScaryNet/batch_normalization/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/ScaryNet/activation/Relu", "StatefulPartitionedCall/ScaryNet/batch_normalization/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ScaryNet/batch_normalization/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/ScaryNet/batch_normalization/FusedBatchNormV3/Mul", "StatefulPartitionedCall/ScaryNet/batch_normalization/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ScaryNet/max_pooling2d/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/ScaryNet/batch_normalization/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/ScaryNet/conv2d_3/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/ScaryNet/max_pooling2d/MaxPool", "StatefulPartitionedCall/ScaryNet/conv2d_3/Conv2D/ReadVariableOp", "StatefulPartitionedCall/ScaryNet/conv2d_3/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/ScaryNet/conv2d_4/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/ScaryNet/conv2d_3/Relu", "StatefulPartitionedCall/ScaryNet/conv2d_4/Conv2D/ReadVariableOp", "StatefulPartitionedCall/ScaryNet/conv2d_4/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/ScaryNet/activation_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/ScaryNet/conv2d_4/Relu", "StatefulPartitionedCall/ScaryNet/conv2d_5/Conv2D/ReadVariableOp", "StatefulPartitionedCall/ScaryNet/conv2d_5/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/ScaryNet/batch_normalization_1/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/ScaryNet/activation_1/Relu", "StatefulPartitionedCall/ScaryNet/batch_normalization_1/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ScaryNet/batch_normalization_1/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/ScaryNet/batch_normalization_1/FusedBatchNormV3/Mul", "StatefulPartitionedCall/ScaryNet/batch_normalization_1/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ScaryNet/max_pooling2d_1/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/ScaryNet/batch_normalization_1/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "3", "3", "1"]}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/ScaryNet/conv2d_6/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/ScaryNet/max_pooling2d_1/MaxPool", "StatefulPartitionedCall/ScaryNet/conv2d_6/Conv2D/ReadVariableOp", "StatefulPartitionedCall/ScaryNet/conv2d_6/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/ScaryNet/conv2d_7/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/ScaryNet/conv2d_6/Relu", "StatefulPartitionedCall/ScaryNet/conv2d_7/Conv2D/ReadVariableOp", "StatefulPartitionedCall/ScaryNet/conv2d_7/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/ScaryNet/conv2d_8/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/ScaryNet/conv2d_7/Relu", "StatefulPartitionedCall/ScaryNet/conv2d_8/Conv2D/ReadVariableOp", "StatefulPartitionedCall/ScaryNet/conv2d_8/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/ScaryNet/max_pooling2d_2/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/ScaryNet/conv2d_8/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/ScaryNet/conv2d_9/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/ScaryNet/max_pooling2d_2/MaxPool", "StatefulPartitionedCall/ScaryNet/conv2d_9/Conv2D/ReadVariableOp", "StatefulPartitionedCall/ScaryNet/conv2d_9/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/ScaryNet/conv2d_10/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/ScaryNet/conv2d_9/Relu", "StatefulPartitionedCall/ScaryNet/conv2d_10/Conv2D/ReadVariableOp", "StatefulPartitionedCall/ScaryNet/conv2d_10/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/ScaryNet/conv2d_11/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/ScaryNet/conv2d_10/Relu", "StatefulPartitionedCall/ScaryNet/conv2d_11/Conv2D/ReadVariableOp", "StatefulPartitionedCall/ScaryNet/conv2d_11/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/ScaryNet/global_average_pooling2d/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/ScaryNet/conv2d_11/Relu", "StatefulPartitionedCall/ScaryNet/global_average_pooling2d/Mean/reduction_indices"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ScaryNet/dense/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/ScaryNet/global_average_pooling2d/Mean", "StatefulPartitionedCall/ScaryNet/dense/MatMul/ReadVariableOp", "StatefulPartitionedCall/ScaryNet/dense/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/ScaryNet/dense_1/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/ScaryNet/dense/Relu", "StatefulPartitionedCall/ScaryNet/dense_1/MatMul/ReadVariableOp", "StatefulPartitionedCall/ScaryNet/dense_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/ScaryNet/dense_1/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/ScaryNet/dense_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/ScaryNet/dense_1/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 716}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/ScaryNet/conv2d/Conv2D/ReadVariableOp", "shape": [11, 11, 3, 36], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ScaryNet/conv2d/BiasAdd/ReadVariableOp", "shape": [36], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ScaryNet/conv2d_1/Conv2D/ReadVariableOp", "shape": [3, 3, 36, 12], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ScaryNet/conv2d_1/BiasAdd/ReadVariableOp", "shape": [12], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ScaryNet/conv2d_2/Conv2D/ReadVariableOp", "shape": [3, 3, 12, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ScaryNet/conv2d_2/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ScaryNet/conv2d_3/Conv2D/ReadVariableOp", "shape": [3, 3, 64, 12], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ScaryNet/conv2d_3/BiasAdd/ReadVariableOp", "shape": [12], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ScaryNet/conv2d_4/Conv2D/ReadVariableOp", "shape": [3, 3, 12, 56], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ScaryNet/conv2d_4/BiasAdd/ReadVariableOp", "shape": [56], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ScaryNet/conv2d_5/Conv2D/ReadVariableOp", "shape": [3, 3, 56, 56], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ScaryNet/conv2d_5/BiasAdd/ReadVariableOp", "shape": [56], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ScaryNet/conv2d_6/Conv2D/ReadVariableOp", "shape": [3, 3, 56, 56], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ScaryNet/conv2d_6/BiasAdd/ReadVariableOp", "shape": [56], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ScaryNet/conv2d_7/Conv2D/ReadVariableOp", "shape": [3, 3, 56, 56], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ScaryNet/conv2d_7/BiasAdd/ReadVariableOp", "shape": [56], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ScaryNet/conv2d_8/Conv2D/ReadVariableOp", "shape": [3, 3, 56, 56], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ScaryNet/conv2d_8/BiasAdd/ReadVariableOp", "shape": [56], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ScaryNet/conv2d_9/Conv2D/ReadVariableOp", "shape": [3, 3, 56, 72], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ScaryNet/conv2d_9/BiasAdd/ReadVariableOp", "shape": [72], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ScaryNet/conv2d_10/Conv2D/ReadVariableOp", "shape": [3, 3, 72, 112], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ScaryNet/conv2d_10/BiasAdd/ReadVariableOp", "shape": [112], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ScaryNet/conv2d_11/Conv2D/ReadVariableOp", "shape": [3, 3, 112, 224], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ScaryNet/conv2d_11/BiasAdd/ReadVariableOp", "shape": [224], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ScaryNet/global_average_pooling2d/Mean/reduction_indices", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/ScaryNet/dense/MatMul/ReadVariableOp", "shape": [224, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ScaryNet/dense/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ScaryNet/dense_1/MatMul/ReadVariableOp", "shape": [32, 2], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ScaryNet/dense_1/BiasAdd/ReadVariableOp", "shape": [2], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ScaryNet/batch_normalization/FusedBatchNormV3/Scaled", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ScaryNet/batch_normalization/FusedBatchNormV3/Offset", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ScaryNet/batch_normalization_1/FusedBatchNormV3/Scaled", "shape": [56], "dtype": "float32"}, {"name": "StatefulPartitionedCall/ScaryNet/batch_normalization_1/FusedBatchNormV3/Offset", "shape": [56], "dtype": "float32"}]}]}